package com.uyou.copenaccount.utils.net.tool;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by zdd on 2018/11/28.
 */

public class FinalContent {

    public static String ent_key1;
    public static String ent_key2;
    public static final Map<String, String> PACKAGE = new HashMap<String, String>() {
        {
            this.put("100000", "自由定制套餐");
            this.put("100001", "X分钟语音、Y兆流量、Z条短信");
            this.put("100002", "购买XM流量送X分钟语音");
            this.put("100003", "语音免费套餐");
            this.put("100006", "最低消费80元，预存话费300元");
            this.put("100008", "最低消费100元，预存话费800元");
            this.put("100009", "最低消费150元，预存话费1500元");
            this.put("100010", "最低消费200元，预存话费2400元");
            this.put("100028", "M分钟语音、N兆流量、P条短信");
            this.put("100033", "充值套餐");
            this.put("100037", "起点文学VIP免费套餐");
            this.put("100038", "家庭医生免费套餐");
            this.put("100039", "SOS救援免费套餐");
            this.put("100040", "星光套餐");
            this.put("100042", "固定日租每天3毛");
            this.put("100048", "酒店折扣免费");
            this.put("100049", "迅雷套餐");
            this.put("100050", "中影票务通套餐");
            this.put("100051", "音悦台VIP会员免费");
            this.put("100055", "Hi-watch");
            this.put("100056", "2元可选包");
            this.put("100058", "老年机产品84元套餐");
            this.put("100059", "老年机产品240元套餐");
            this.put("100060", "月返还10分钟语音、10M流量可选包");
            this.put("100061", "月返还120分钟语音、60M流量可选包");
            this.put("100062", "快捷酒店免费(永久有效)");
            this.put("100063", "快捷酒店免费0元/次");
            this.put("100064", "无最低消费，预存金额有效期一年，预存话费12000元");
            this.put("100065", "无最低消费，预存金额有效期一年，预存话费10000元");
            this.put("100066", "无最低消费，预存金额有效期一年，预存话费8000元");
            this.put("100067", "最低消费200元，预存话费2400元");
            this.put("100068", "最低消费150元，预存话费1500元");
            this.put("100069", "最低消费100元，预存话费800元");
            this.put("100070", "最低消费80元，预存话费300元");
            this.put("100071", "最低消费200元，预存话费600元");
            this.put("100072", "最低消费36元，预存话费100元");
            this.put("100079", "短信白名单套餐");
            this.put("100092", "5元(40M流量包)");
            this.put("100093", "10元(80M流量包)");
            this.put("100094", "20元(160M流量包)");
            this.put("100095", "天猫无月租产品");
            this.put("100096", "月低消15元可选包");
            this.put("100097", "国际漫游卡自由套餐");
            this.put("100099", "来电显示(5元/月)");
            this.put("100100", "天猫无月租产品(5元低消版)");
            this.put("100101", "月低消5元可选包");
            this.put("100103", "最低消费158元，预存话费600元");
            this.put("100104", "最低消费68元，预存话费300元");
            this.put("100105", "魔卡套餐");
            this.put("100106", "畅聊卡套餐");
            this.put("100107", "来电显示(6元/月)");
            this.put("100108", "30元(240M流量包)");
            this.put("100109", "10元包60M流量包");
            this.put("100110", "灵卡套餐");
            this.put("100111", "畅游卡套餐");
            this.put("100118", "U.友优享");
            this.put("100119", "40元(320MB流量包)");
            this.put("100120", "50元(400MB流量包)");
            this.put("100121", "U.友优行");
            this.put("100122", "U.友优选");
            this.put("570035", "4G上网");
            this.put("600000", "移动测试套餐");
            this.put("600001", "来电显示可选包(6元/月)");
            this.put("600002", "来电提醒可选包");
            this.put("600004", "国际及港澳台业务资源池虚拟模组");
            this.put("600045", "虚拟网群组套餐");
            this.put("610000", "U友畅行-98元套餐");
            this.put("610004", "来电显示可选包");
            this.put("610005", "U友畅享移动产品");
            this.put("610006", "5元流量包（30mb，首月默认）-临时标批模组");
            this.put("610007", "10元流量包(70MB)");
            this.put("610008", "20元流量包(150MB)");
            this.put("610009", "30元流量包(500MB)");
            this.put("610010", "40元流量包(700MB)");
            this.put("610011", "50元流量包(1GB)");
            this.put("610012", "70元流量包(2GB)");
            this.put("610013", "100元流量包(3GB)");
            this.put("610014", "130元流量包(4GB)");
            this.put("610015", "180元流量包(5GB)");
            this.put("610016", "280元流量包(11GB)");
            this.put("610017", "语音包（非标批）");
            this.put("610018", "来电显示可选包（6元/月）");
            this.put("610019", "短信包（非标批）");
            this.put("610022", "语音包（标批）");
            this.put("610023", "5元流量包（30M)");
            this.put("610024", "短信包（标批）");
            this.put("610025", "U友畅享移动天猫产品");
        }
    };

    public FinalContent() {
    }
}
